# taps
tap "buo/cask-upgrade"
tap "hmans/beans"
tap "lotyp/homebrew-formulae"
tap "hashicorp/tap"
tap "rendro/tap"
tap "pchalasani/tap"

# dependencies
brew "git"
brew "tcl-tk"
brew "readline"
brew "ncurses"
brew "zlib"
brew "less"
brew "fd"
brew "libyaml"
brew "ripgrep"

# programs
brew "argocd"
brew "direnv"
brew "bat"
brew "eza"
brew "fzf"
brew "helm"
brew "jq"
brew "k9s"
brew "kubectl"
brew "kubeconform"
brew "just"
brew "minikube"
brew "gh"
brew "lazygit"
brew "lazydocker"
brew "git-delta"
brew "zellij"
brew "uv"
brew "oh-my-posh"
brew "git-spice"
brew "sheldon"
brew "zoxide"
brew "ast-grep"
brew "atuin"
brew "rtk"
brew "terramate"
brew "yamllint"
brew "prek"
brew "zsh"
brew "anomalyco/tap/opencode"
brew "hmans/beans/beans"
brew "aichat-search"

# terraform
brew "warrensbox/tap/tfswitch"

# utility management
brew "lotyp/formulae/dockutil"

# password management
brew "1password-cli"

# mac app store
brew "mas"
