# normal casks
cask "arc"
cask "spark"
cask "docker"
cask "ghostty"
cask "raycast"
cask "sublime-text"
cask "slack"
cask "the-unarchiver"
cask "google-cloud-sdk"
cask "1password"
cask "claude-code"
cask "codex"
cask "datagrip"
cask "yaak"
cask "hiddenbar"
cask "alcove"
cask "spotify"

# fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# development tools
cask "cursor"
