# taps
tap "buo/cask-upgrade"
tap "lotyp/homebrew-formulae"
tap "hashicorp/tap"

# dependencies
brew "git"
brew "tcl-tk"
brew "readline"
brew "ncurses"
brew "zlib"
brew "less"
brew "fd"
brew "libyaml"
brew "ripgrep"

# programs
brew "direnv"
brew "bat"
brew "eza"
brew "fzf"
brew "jq"
brew "k9s"
brew "just"
brew "minikube"
brew "gh"
brew "lazygit"
brew "uv"
brew "oh-my-posh"
brew "git-spice"
brew "sheldon"
brew "zoxide"
brew "atuin"
brew "terramate"
brew "codex"
brew "yamllint"

# terraform
brew "warrensbox/tap/tfswitch"

# app store and utility management
brew "mas"
brew "lotyp/formulae/dockutil"

# appstore - before casks to ensure priority
mas "Fantastical", id: 975937182
mas "Spark", id: 1176895641
mas "Hidden Bar", id: 1452453066
mas "1Password 7 - Password Manager", id: 1333542190

# normal casks
cask "arc"
cask "docker"
cask "iterm2"
cask "raycast"
cask "sublime-text"
cask "slack"
cask "the-unarchiver"
cask "google-cloud-sdk"
cask "altair-graphql-client"
cask "claude"

# fonts
cask "font-fira-code"
cask "font-fira-code-nerd-font"

# development tools
cask "cursor"

# cursor extensions - core functionality
cursor "charliermarsh.ruff"
cursor "redhat.vscode-yaml"
cursor "tamasfe.even-better-toml"
cursor "skellock.just"
cursor "editorconfig.editorconfig"

# cursor extensions - git & github
cursor "eamodio.gitlens"
cursor "github.vscode-github-actions"
cursor "jasonnutter.vscode-codeowners"

# cursor extensions - ai assistance
cursor "anthropic.claude-code"
cursor "openai.chatgpt"

# cursor extensions - general utilities
cursor "gruntfuggly.todo-tree"
cursor "aaron-bond.better-comments"
cursor "fabiospampinato.vscode-highlight"
cursor "ldez.ignore-files"

# cursor extensions - python
cursor "ms-python.python"
cursor "anysphere.cursorpyright"
cursor "donjayamanne.python-environment-manager"
cursor "irongeek.vscode-env"
cursor "kevinrose.vsc-python-indent"
cursor "ms-python.debugpy"

# cursor extensions - data & notebooks
cursor "ms-toolsai.jupyter"
cursor "ms-toolsai.jupyter-renderers"
cursor "ms-toolsai.vscode-jupyter-cell-tags"
cursor "ms-toolsai.vscode-jupyter-slideshow"
cursor "aykutsarac.jsoncrack-vscode"

# cursor extensions - markdown
cursor "bierner.markdown-mermaid"
cursor "shd101wyy.markdown-preview-enhanced"
cursor "yzhang.markdown-all-in-one"

# cursor extensions - templating
cursor "samuelcolvin.jinjahtml"
cursor "hongquan.dragon-jinja"

# cursor extensions - themes and visuals
cursor "oderwat.indent-rainbow"
cursor "vscode-icons-team.vscode-icons"
cursor "github.github-vscode-theme"
cursor "sirtori.indenticator"

# cursor extensions - containers & kubernetes
cursor "ms-azuretools.vscode-containers"
cursor "anysphere.remote-containers"
cursor "ms-kubernetes-tools.vscode-kubernetes-tools"

# cursor extensions - terraform
cursor "4ops.terraform"
cursor "pjmiravalle.terraform-advanced-syntax-highlighting"
cursor "mineiros.terramate"