# configure homebrew
tap "homebrew/bundle"
tap "homebrew/services"
tap "buo/cask-upgrade"
tap "lotyp/homebrew-formulae"

# dependencies
brew "git"
brew "git-delta"
brew "tcl-tk"
brew "readline"
brew "ncurses"
brew "zlib"
brew "less"
brew "fd"

# programs
brew "pyenv"
brew "fzf"
brew "direnv"
brew "bat"
brew "lsd"
brew "httpie"
brew "pipx"
