brew "mas"
brew "r"
brew "lotyp/formulae/dockutil"

# appstore - before casks to ensure priority
mas "Fantastical", id: 975937182
mas "Spark", id: 1176895641
mas "Hidden Bar", id: 1452453066

# normal casks
cask "bitwarden"
cask "arc"
cask "docker"
cask "iterm2"
cask "raycast"
cask "notion"
cask "rstudio"
cask "sublime-text"
cask "slack"
cask "the-unarchiver"
cask "google-cloud-sdk"
cask "ngrok"
cask "altair-graphql-client"